


/*
//===========================================================================//
 1  加入GSM开机延时 GSM_Start_Count 一分钟   测试通过
        while((!(P4IN&BIT5))&&(GSM_Start_Count<SECD_30))            ;
 2  2013.12.11 蒋本庆加入防止反复写flash状态标志

 3  ARM_DATA_STU &= ~0x01;//2013.12.13 低功耗时 ARM信息清零

 4  ARM_DATA_STU &= ~0x04;//2013.12.13 低功耗时 GPS信息清零

 5  //GSM_MCU[MCU_CNT]=0;去掉此处 2013.12.13 防止出现0数据

 6  2013.12.14 修改手机卡号检测处理程序

 7  2014.01.02 加入断电上传一次MCU

 8  2014.01.02 检测MCU报警

        一级报警
               &&((GSM_MCU[1]>140)||((GSM_MCU[10]&0x03)==0x03))//水温高报警
                ||(((GSM_MCU[10]&0x0C)==0x0C))//机油压力低
                //||(((GSM_MCU[11]&0x0C)==0x0C))  //发动机机油温度高报警
                  ||((GSM_MCU[6]>190)||(GSM_MCU[7]>190))//主泵压力P1 P2
        
        二级报警：
                &&(((GSM_MCU[11]&0x30)==0x30))  // 冷却液液位低报警
                ||(((GSM_MCU[11]&0xC0)==0xC0))  // 空滤堵塞报警
                ||(((GSM_MCU[12]&0x03)==0x03))  // 液压油油滤堵塞报警
                ||(((GSM_MCU[12]&0x0C)==0x0C))  // 油水分离报警 

9   2014.01.06 刷本程序车  L1CD0081 试制车间908C  培训学校906D

10  2014.01.13签到 刷本程序车  L1CD0081 
                 试制车间908C  培训学校906D（未更新程序）

11  2014.01.13  修改无卡 换卡报警
12  2014.01.16  修改if((ARM_DATA_STU&0x04)==0x04){//GPS数据有效     

    startPoint:118.43902,34.93596
    endPoint:  118.4461, 34.93300

    118.4390  34.93596
    118.4461  34.93300
    
    70826164
    20456084

12  2014.01.24  签到
    


13  2014.02.12   修改原因  原协议中没有系统压力A、B报警标志，修改协议，本次修改特加入该一级报警判断标志
    CHECK_MCU_WARN(void)  //检测MCU报警  函数中 
    原程序： (UDP_B||((GSM_MCU[6]>195)||(GSM_MCU[7]>195))) //主泵压力P1 P2 
    修改为： ((GSM_MCU[12]&0x30)==0x30)||((GSM_MCU[12]&0xC0)==0xC0))//主泵压力P1 P2
    测试结论：通过测试 (测试人 蒋本庆)






//===========================================================================//

*/


















